# -*- coding: utf-8 -*-

#+TITLE: Starter Kit Lisp
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

** Racket
Starting to use Racket now, mainly for programming paradigms class, though I'm looking forward to some “REPL-driven development” whenever I get the chance.
Turned off as it seems Geiser works better.

#+BEGIN_SRC emacs-lisp 
(use-package racket-mode
  :ensure t
  :commands racket-mode
  :mode 
  ("\\.rkt[dl]?\\'" . racket-mode) ;; to enable racket-mode when I open a .rkt file. See http://coldnew.github.io/coldnew-emacs/#orgheadline1
  :config 
  (setq racket-smart-open-bracket-enable t))
#+END_SRC


Configuration that I've copied from above and applied to racket:

#+BEGIN_SRC emacs-lisp 
(add-hook 'racket-mode-hook 'run-starter-kit-coding-hook)
;; (add-hook 'racket-mode-hook 'idle-highlight)
(font-lock-add-keywords 'lisp-mode
			'(("(\\|)" . 'esk-paren-face)))

#+END_SRC

#+RESULTS:


Configuration from https://github.com/greghendershott/racket-mode 

#+BEGIN_SRC emacs-lisp 
(add-hook 'racket-mode-hook      #'racket-unicode-input-method-enable)
(add-hook 'racket-repl-mode-hook #'racket-unicode-input-method-enable)
#+END_SRC

#+RESULTS:
| racket-unicode-input-method-enable |

In the Git of racket-mode at https://github.com/greghendershott/racket-mode they propose this binding, but why? Already =C-c C-c= does the job of =racket-run=.

#+BEGIN_SRC emacs-lisp 
;;(add-hook 'racket-mode-hook
;;          (lambda ()
;;            (define-key racket-mode-map (kbd "C-c r") 'racket-run)))
#+END_SRC

From  https://github.com/matklad/.emacs.d/blob/master/rc/coding.el and https://github.com/Fuco1/smartparens/wiki/Pair-management but the new implementation of =smartparens= make this redundant. 

Moved to -text.org

#+BEGIN_SRC emacs-lisp 
;; (sp-local-pair 'racket-mode "'" nil :actions nil) 
;; (sp-local-pair 'racket-mode "`" nil :actions nil)
#+END_SRC


